{"data":{"markdownRemark":{"html":"<p>Living in Austin has been fun and I have a couple things I highly recommend if you're visiting: food and urban nature.</p>\n<h3>Walk/jog or bike the trail around Lady Bird Lake/Colorado River</h3>\n<p><img src=\"https://i.imgur.com/PLrarMx.png\" alt=\"austin trail map\"></p>\n<p>While my preferred route is about <strong>6.8 miles</strong>, there are plenty of opportunities to cut the hike/biking short if you want. However, I definitely would recommend doing the whole thing in order to get the best views. Definitely go in the morning (especially in the summer), to avoid the heat.</p>\n<p>If you take my route, I recommend you start at Zilker Park. You can definitely just hangout there by the volleyball sand courts/dog park and get some nice pictures of the skyline, though. However, if you get on the trail headed east, you'll eventually get to Barton Creek where you hit a nice little corner with a nice, more up-close view of the skyline and the water. A few steps from that corner, you'll be met with many turtles, ducks, and a few fairly territorial swans. </p>\n<p>Just don't mess with <a href=\"https://instagram.fmkc1-1.fna.fbcdn.net/vp/ea4cb50aada6ae4c2e174a4b1a75a4a0/5BC92F5C/t51.2885-15/e35/26186301_169773027084656_6700995983670509568_n.jpg\">the swans</a>.</p>\n<p>As you head south from there, you'll encounter a bridge that goes over Barton Creek and head north once you're across it. You'll start to get closer to downtown and eventually get to the off-leash dog park. You'll see some of the cutest dogs ever. </p>\n<p>Continuing east, you'll just get more sights and sounds of an urban park. You'll eventually end up on the Austin Boardwalk which is pretty nice. Once you cross over to the downtown side, you can stop at some place like Berry Austin for some froyo or trek onward. There's a bit less going on on the northside but still an enjoyable and peaceful walk back around to Zilker.</p>\n<h3>Alternative: Go kayaking (or try Stand Up Paddle Boarding)</h3>\n<p>If you're not feeling up for a walk around the trail, you should definitely still rent a kayak and cruise the water. </p>\n<p>The lake/river downtown are conveniently located for kayaking/paddle boarding but if you don't mind going a little further out, you could also check out Lake Travis.</p>\n<h3>Eat BBQ and Tex-Mex</h3>\n<p>This is a pretty obvious one if you've ever heard of Austin, I think. In no particular order:</p>\n<p><strong>BBQ</strong></p>\n<ul>\n<li>Black's Barbecue</li>\n<li>Franklin Barbecue (pre-order online or wait in line for a couple hours, your choice)</li>\n<li>Valentina's Tex Mex BBQ</li>\n</ul>\n<p><strong>Tex-Mex // Mexican</strong></p>\n<ul>\n<li>Maudie's - Tex-Mex</li>\n<li>Valentina's Tex Mex BBQ - Tex-mex</li>\n<li>Juan in a Million - Mexican</li>\n<li>Fresca's - Mexican</li>\n<li>Guero's Taco Bar - Mexican</li>\n</ul>\n<p>bonus: (not tex-mex or bbq): <a href=\"http://www.burrocheesekitchen.com/\">Burro Cheese Kitchen</a> (cheesy stuff)</p>\n<h3>Drink coffee</h3>\n<ul>\n<li>Fresca's, order the \"Cafe de Olla\"</li>\n<li>Cafe Creme, order the Mexican Mocha OR White Chocolate Mocha (try their crepés while you're there too!)</li>\n</ul>\n<p>For decent coffee with a nice view, try Mozarts'.</p>\n<h3>Other Things</h3>\n<ul>\n<li>Check out the local improv comedy theater: <a href=\"http://www.hideouttheatre.com/\">The Hideout</a></li>\n<li>Visit the cat cafe: <a href=\"https://www.bluecatcafe.com/\">Blue Cat Cafe</a></li>\n<li>Taste some artisinal cheese! <a href=\"https://www.antonellischeese.com/Default.asp\">Antonelli's Cheese Shop</a>, their <a href=\"https://www.eventbrite.com/o/antonellis-cheese-shop-1810085521\">events</a></li>\n<li>Go swimming at Hamilton Pool Preserve in Dripping Springs, <a href=\"https://parks.traviscountytx.gov/find-a-park/hamilton-pool\">reservation needed</a></li>\n<li>Take the short hike up to Mount Bonnell for a nice view</li>\n<li>Try some awesome cupcakes over at <a href=\"https://www.heycupcake.com/\">Hey Cupcake!</a> located on Congress Avenue</li>\n</ul>","frontmatter":{"title":"Things I like doing in Austin","date":"July 20, 2018","tags":["personal"]}}},"pageContext":{"slug":"blog/2018/07-20-what-i-like-doing-in-austin/","date":"2018-07-20T08:53:00.000Z"}}