{"data":{"markdownRemark":{"html":"<p>I have generalized anxiety.</p>\n<p>Essentially, I feel anxiety while doing daily activities.</p>\n<p>I found out it wasn't \"normal\" to have the thoughts and feelings I had.</p>\n<p>I actually didn't realize how extreme it was until a couple years ago when I really wanted to describe what I was thinking to a friend. Let them in on my hell. I wrote down every thought I had. It was pages of thoughts for doing an activity. That activity was riding the bus for about 10 minutes from my apartment to downtown Austin. I have a car but I wanted to hangout at the library for some time and didn't want to worry about parking.</p>\n<p>My thoughts when I woke up on that morning were...</p>\n<blockquote>\n<p>Nevermind. I do not want to do it. I said I would but I don't have to. But then I have to tell my husband and it'd be embarassing to have to explain why. I have some coins but what if I don't take enough. I doubt they allow me to pay by card. I never carry cash - who does these days? What if I don't have enough and the driver has to tell me? What do I tell him? What if he makes me get off? What if I miss the bus and look like a fool showing up as it pulls off? What will the people on the bus think because I'm late? What if more than one bus stops there and I am expected to signal to the driver that I'm not taking <em>their</em> bus? Will they be mad? I still don't think I have enough money. I wonder if that'd be ok? If they'd feel bad for me and let me ride anyway? What if the machine is broken? What if the bus is full and I have to stand? Will I lose my balance? Will people make fun of me if I lose my balance? What if there's someone crazy on the bus? What if I miss my stop? Do I have coins anywhere else that I can take just in case? I don't want to ride the bus.</p>\n</blockquote>\n<p>Like most other episodes of anxiety, I turned to the phrase that has always pushed me past my anxiety.</p>\n<blockquote>\n<p>\"Fuck it.\"</p>\n</blockquote>\n<p>And then, I just do whatever I was having anxiety about. It's like my verbal way to splash cold water in my face. It works for me - and I wish I could remember to say it each time to myself but sometimes the anxiety does just block it out. Other times, it squeezes in and I push through.</p>","frontmatter":{"title":"F*ck It","date":"June 28, 2019","tags":["personal","mental-health"]}}},"pageContext":{"slug":"blog/2019/06-25-2019-f*ck-it/","date":"2019-06-28T21:50:00.000Z"}}