{"data":{"markdownRemark":{"html":"<p>For me, 2018 was about establishing a healthy work/life balance. Here's a little bit more of an-depth look at my year.</p>\n<h3>Work</h3>\n<p>I started out this year unemployed and depressed. I had quit my job in August 2017 and took several months off to take some trips and figure out what I wanted out of my next job. </p>\n<p>As I worked through my depression and felt the helplessness lift off my shoulders, I started to think of what I'd like in my next position. I had always worked for small companies and while working through my depression, I realized that a big source of stress for me had been that I would often end up feeling like I had no one to reach out to at work when feeling overwhelmed. I also didn't feel like I could bounce ideas off anyone because everyone just assumed I was right. I was the one to always get stuff done and usually quickly -- they knew it and I think I encouraged that idea by never pushing back. This led to me being placed in a lot of high pressure situations that'd keep me up at night. And I often felt that it was all my fault so I just had to get through it.</p>\n<p>By December 2017, I decided I needed to prioritize my mental health more in my next position. I would need to be working on a product I'd be passionate about so that I can look forward to contributing to it even when the pressure is on. I would need it to be 100% remote as I am not a fan of small-talk/distractions/disruptions at the office (at least at home I have more control over them) and prefered to avoid the DFW commute. I also prefer to work heads down when possible. The front-end team would need to be composed of several experienced engineers that I can continue to learn from and share ideas with. On top of those things, I really wanted to be around other engineers/managers that were passionate both about the project and the tech. </p>\n<p>It took a couple months but I found a company that checked off all those boxes. A big healthcare company with thousands of employees. Not really what I expected but definitely hit all boxes for me so I accepted the offer.</p>\n<ul>\n<li class=\"task-list-item\"><input type=\"checkbox\" checked disabled> Passionate about project (new web platform for company)</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" checked disabled> 100% remote</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" checked disabled> UI-focused</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" checked disabled> Big front-end team</li>\n<li class=\"task-list-item\"><input type=\"checkbox\" checked disabled> Reusable UI component library w/emphasis on front-end architecture standards</li>\n</ul>\n<h3>Life</h3>","frontmatter":{"title":"2018 in review","date":"December 26, 2018","tags":["personal"]}}},"pageContext":{"slug":"blog/2018/12-26-bring-on-2019/","date":"2018-12-26T14:30:00.000Z"}}